[{
  "text": "Ever noticed a plastic-like layer under the eggshell? Don’t worry; it’s completely normal!\n\nThis egg membrane forms in every egg, varying in thickness based on the breed. Brown eggs usually have a thicker one, but rest assured, it’s 100% normal.\n\nGot more egg-related questions? Drop them in the comments!\n\n[Farm Made Foods, Your Right Choice, Free-range eggs, Egg Membrane, FAQs, Egg Lovers, Egg-related questions, Common Questions about Eggs, Know Your Food, Eggshells]\n\n#farmmadefoods #yourightchoice #freeerangeeggs #freerange #eggshells #faqs",
  "facebookId": "100064851213767",
  "shares": 0,
  "likes": 0
},
{
  "text": "Our Queens have mastered the art of stress-free living! Take notes from them. \n\n[Farm Made Foods, Your Right Choice, Free-range Eggs, Healthy Hens, Farm Life, Life full of Freedom, Free-range Farm, Life on our Farm, Free-range Farming, Free from Stress, Freedom, 3 Tips to Live a Stree-free Life]\n\n#farmmadefoods #yourrightchoice #freerangeeggs #3tips",
  "facebookId": "100064851213767",
  "viewsCount": 8,
  "shares": 0,
  "likes": 1
},
{
  "text": "Lemon bars that are just the right mix of tangy and sweet. 🍋\n\nIngredients:\nFor the bars:\n-2 free-range eggs\n-150gm flour\n-150gm coconut sugar \n-120gm softened butter \n-1 tbsp lemon zest \n-2 tbsp lemon juice\n\nFor the glaze:\n-1 tsp lemon zest \n-4 tbsp lemon juice \n-3 tbsp powdered coconut sugar\n\nMethod:\n-Line and grease the bottom of a square or rectangular baking dish with parchment paper and set aside.\n-In a bowl, mix together the flour, butter and coconut sugar until it forms a sticky dough, and set aside. \n-In another bowl, whisk together the free-range eggs, lemon juice and zest, and add it to the previous mixture. \n-Fold just until all the lumps have dissolved, and the batter is smooth. \n-Pour it into the lined dish, and bake at 170°C for 20 minutes, or until toothpick inserted, comes out clean. \n-Set aside to cool, and cut into bars. \n-For the glaze, whisk together the lemon zest, juice, and coconut sugar until the coconut sugar has fully dissolved. \n-Adjust with more lemon juice or coconut sugar, according to the desired consistency. \n-Pour the glaze over the bars just before serving, and enjoy.\n\n[Farm Made Foods, Your Right Choice, Free-range Eggs, Lemon Bars, Easy to Make, Easy Recipes, Desserts, Easy Dessert Recipes, Desserts using Lemon, Coconut Sugar, Sweets made using Coconut Sugar, Dessert Ideas]\n\n#farmmadefoods #yourrightchocie #freerangeeggs #coconutsugar #lemonbars",
  "facebookId": "100064851213767",
  "viewsCount": 7,
  "shares": 0,
  "likes": 0
},
{
  "text": "Life is simple and sweet under open skies. Our hens wander, forage, and rest wherever they like, enjoying the little joys of nature every day.\n\n[Farm Made Foods, Your Right Choice, Free-range eggs, Life on our farm, Healthy Eggs, Healthy Hens, Freedom]\n\n#farmmadefoods #yourightchoice #freeerangeeggs #healthyeggs",
  "facebookId": "100064851213767",
  "shares": 0,
  "likes": 0
},
{
  "text": "Perching is the ultimate way for our Queens to unwind and feel at peace. Our Queens roam freely under open skies at our free-range farm, relish a natural diet, and enjoy the simple joys of foraging. Whether it's stretching their wings, basking in nature, or finding the perfect perch, they live life on their own terms!\n\n[Farm Made Foods, Your Right Choice, Free-range Eggs, Perching, Characteristics of Hens, Behaviours of Hens, Free-range Farming, Perch, Hens Perching]\n\n#farmmadefoods #yourrightchoice #freerangeeggs #perching #freerangefarming",
  "facebookId": "100064851213767",
  "shares": 0,
  "likes": 0
},
{
  "text": "Golden, fluffy, and oh-so-buttery! Try out this Butter Garlic Scrambled Eggs recipe and tell us how you like it.\n\nIngredients:\n-3 free-range eggs\n-1 tbsp chilli lakes\n-3 tbsp garlic (chopped)\n-1 tsp pepper\n-2 tsp Italian seasoning\n-1 tbsp cornflour\n-200ml milk\n-1 tbsp butter \n-1 tsp spring onions (finely chopped)\n--Sesame seeds (for garnish)\n\nMethod:\n-In a medium sized bowl, crack 3 free-range eggs. \n-Sprinkle in the chilli flakes, pepper, and half of the chopped garlic, and whisk together until combined.\n-Cook the mixture in a pan on low to medium heat until the eggs are just about cooked. Set aside.\n-In the same pan, melt some butter on low heat, add in the remaining garlic, Italian seasoning, cornflour and milk. \n-Cook until the mixture forms a thick sauce, and add the scrambled eggs back into this sauce. \n-Gently fold in the eggs, until it's fully coated with the sauce. -\n-Garnish with thinly sliced spring onions, sesame seeds, and serve with toasted bread. \n\n[Farm Made Foods, Your Right Choice, Free-range eggs, Butter Garlic Scrambled Eggs, Easy to Make, Easy Recipes, Eggs, Egg Recipes, Breakfast Ideas, Easy Meals, Scrambled Eggs]\n\n#farmmadefoods #yourrightchocie #freerangeeggs #buttergarlicscrambledeggs #eggrecipes #quickrecipes #easyrecipes",
  "facebookId": "100064851213767",
  "viewsCount": 11,
  "shares": 0,
  "likes": 0
},
{
  "text": "It brings us so much joy to see our customers sharing their love for our free-range eggs. Thank you for being a part of the Farm Made Foods family! \n\n[Farm Made Foods, Your Right Choice, Free-range eggs, Customer Testimonials, Customer Feedback, Testimonials, Customer Reviews]\n\n#farmmadefoods #yourightchoice #freerangeeggs #testimonials",
  "facebookId": "100064851213767",
  "viewsCount": 9,
  "shares": 0,
  "likes": 0
},
{
  "text": "Aquarians, your Zodiyolk sign is shining bright! Tag your fellow Aquarians in the comments to let them know their Zodiyolk personality.\n\n[Farm Made Foods, Your Right Choice, Free-range Eggs, Zodiac Signs, What’s your Zodiac, Egg Personalities, Zodiyolk Signs, Aquarius, Aquarians]\n\n#farmamdefoods #yourrightchoice #freerangeeggs #zodiacsigns #aquarius #aquarian",
  "facebookId": "100064851213767",
  "shares": 0,
  "likes": 1
},
{
  "text": "Every day on our farm is laid-back, with our hens roaming freely, pecking around, and just chilling in the open fields. It’s simple, natural, and exactly how life should be.\n\n[Farm Made Foods, Your Right Choice, Free-range Eggs, Healthy Hens, Farm Life, Life Full of Freedom, Hens Roaming Freely, Free-range Farm, Free-range, Farming, Living the Best Life]\n\n#farmmadefoods #yourrightchoice #freerangeeggs #farmlife #healthyhens #healthyeggs",
  "facebookId": "100064851213767",
  "viewsCount": 10,
  "shares": 0,
  "likes": 0
},
{
  "text": "Just another day where one of our Queens is seen chilling in the outdoors and soaking up the best that nature has to offer!\n\n[Farm Made Foods, Your Right Choice, Free-range Eggs, Healthy Hens, Life on our Farms, Living the Best Life, Ethical Farming Practices, Life of our Hens, Freedom, Care]\n\n#farmmadefoods #yourrightchoice #freerangeeggs #healthyhens",
  "facebookId": "100064851213767",
  "shares": 0,
  "likes": 0
},
{
  "text": "Our queens thrive under open skies, embracing carefree lives filled with freedom and joy. They forage at their own pace, exploring nature’s bounty, and lounge wherever they please, making every day feel like a retreat. \n\n[Farm Made Foods, Your Right Choice, Free-range eggs, Life on our farm, Healthy Eggs, Healthy Hens, Freedom]\n\n#farmmadefoods #yourightchoice #freeerangeeggs ##healthyeggs",
  "facebookId": "100064851213767",
  "shares": 0,
  "likes": 0
},
{
  "text": "",
  "facebookId": "100064851213767",
  "shares": 0,
  "likes": 0
},
{
  "text": "Our queens live a life without any contact with roosters, laying eggs that are naturally infertile and pure. This ensures our eggs are crafted with a focus on quality, nutrition, and safety. By choosing free-range eggs from Farm Made Foods, you’re embracing guilt-free goodness and proudly making your right choice.\n\n#farmmadefoods #yourightchoice #freeerangeeggs #healthyeggs #faqs \n#customerfaqs\n\n[Farm Made Foods, Your Right Choice, Free-range eggs, FAQs, Egg Lovers, Egg-related questions, Common Questions About Eggs, Healthy Eggs]",
  "facebookId": "100064851213767",
  "shares": 0,
  "likes": 0
},
{
  "text": "A little mess, a lot of flavour! Enjoy Anda Ghotala at its finest. \n\nIngredients:\n-5 free-range eggs\n-2 onions (finely chopped)\n-3 green chillis (finely chopped)\n-2 tomatoes (finely chopped)\n-3 tbsp oil \n-½ tsp cumin seeds \n-1 tsp turmeric powder \n-1 tbsp red chilli powder \n-½ tbsp salt \n-1 tbsp garam masala \n-Coriander leaves (for garnish) \n\nMethod:\n-Heat oil in a kadhai, add cumin seeds and cook until they start sizzling and are aromatic.\n-Add onions, green chilli and saute it until light brown in colour.\n-Add tomatoes to this. \n-Lightly sauté and then add turmeric powder, garam masala powder, chilli powder and salt. \n-Once tomatoes soften, crack 2 free-range eggs and scramble in this onion tomato masala.\n-Now, grate 2 hard boiled free-range eggs to this scrambled mixture and mix well.\n-Transfer the Anda Ghotala into a dish.\n-In a pan, gently fry 1 free-range egg, place it on the Anda Ghotala and garnish with coriander leaves.\n-Serve hot with toasted pav.\n\n[Farm Made Foods, Your Right Choice, Free-range Eggs, Anda Ghotala, Egg Recipes, Easy To Make, Easy Meal Ideas, Eggs for Breakfast, Breakfast Ideas, Easy Egg Recipes]\n\n#farmmadefoods #yourrightchoice #freerangeeggs #andaghotala #eggrecipes #quickrecipes #easyrecipes",
  "facebookId": "100064851213767",
  "viewsCount": 18,
  "shares": 0,
  "likes": 0
},
{
  "text": "Just like you have zodiac signs, your egg personalities have Zodiyolk Signs! Stay tuned to find out what your Zodiyolk Sign is - your birthday month is when you will find out!\n\n#farmamdefoods #yourrightchoice #freerangeeggs #healthyhens #zodiacsigns #capricorn\n\n[Farm Made Foods, Your Right Choice, Free-range Eggs, Zodiac Signs, What’s your Zodiac, Egg Personalities, Zodiyolk Signs, Capricorn]",
  "facebookId": "100064851213767",
  "shares": 0,
  "likes": 0
},
{
  "text": "Our hens thrive by foraging freely in open spaces – pecking the soil, scratching through leaves, and uncovering little treasures like seeds and insects. This instinctive behavior keeps them active, healthy, and stress-free.\n\nBy choosing our free-range eggs, you’re supporting a lifestyle that’s better for our hens and our planet!\n\n[Farm Made Foods, Your Right Choice, Free-range Eggs, Healthy Hens, Farm Life, Life full of Freedom, Certified Humane, Foraging, Activities of a Hen, Natural Behaviour, Instincts of a Hen, What Hens Enjoy, Hens, Life of Hens]\n\n#farmmadefoods #yourrightchoice #freerangeeggs #freerange #healthyeggs #Foraging",
  "facebookId": "100064851213767",
  "shares": 0,
  "likes": 0
},
{
  "text": "Warm and irresistibly soft – these Apple Cinnamon Rolls are a hug in every bite! Try this recipe using free-range eggs and coconut sugar from Farm Made Foods!\n\nIngredients:\nFor the dough:\n-2 free-range eggs\n-1 free-range egg yolk\n-110gm coconut sugar\n-580gm all-purpose flour \n-84gm butter\n-235ml milk\n-7gm instant dry yeast\n\nFor the filling:\n-225gm coconut sugar\n-2-3 apples (thinly sliced, soaked in warm water with a squeeze of lemon juice)\n-2½ tbsp cinnamon\n-90gm softened butter\n\nMethod:\n-Whisk together all-purpose flour, coconut sugar, and yeast in a large bowl.\n-In a separate container, whisk together the warm milk, free-range eggs and the free-range egg yolk, and add it to the dry flour mix. \n-Mix together until it forms a rough dough.\n-Knead for 8-10 minutes until there are no more streaks of flour visible. \n-Add in the softened butter and knead well until the butter is fully incorporated into the dough. \n-Grease the same large bowl, place the dough inside, cover with a warm tea towel and store in a warm place for 80-90 minutes - until the dough has doubled in size. \n-For the filling, mix together the butter, coconut sugar, and cinnamon until it forms a smooth paste, and set aside. \n-Once the dough has proofed, turn it out onto a well floured surface, and roll out into a large rectangle. \nSpread the butter, cinnamon and coconut sugar, using an off-set palette knife. \n-Cut the dough into strips, layer the apple slices (slightly overlapping each other), and roll into tight spirals. \n-Place in a well greased muffin tray and bake at 170°C for 20-25 minutes or until the dough is golden brown in color. \n-Remove from the oven, allow it to cool down.\n-Dust with icing sugar and serve.\n\n[Farm Made Foods, Your Right Choice, Free-range Eggs, Coconut Sugar, Apple Cinnamon Rolls, Cake Recipe, Easy Baking, Dessert Lovers, Dessert Recipes, Dessert, Dessert Lovers, Sweet Treat, Baking]\n\n#FarmMadeFoods #YourRightChoice #FreeRangeEggs #CoconutSugar #AppleCinnamonRolls",
  "facebookId": "100064851213767",
  "viewsCount": 47,
  "shares": 0,
  "likes": 2
},
{
  "text": "Grateful for all the kind words and love that come our way! :) \n\n[Farm Made Foods, Your Right Choice, Free-range Eggs, Customer Testimonials, Sustainable Choices, Healthy Eggs, Brown Eggs, Testimonials, Customer Feedback]\n\n#farmmadefoods #yourrightchoice #freerangeeggs #customertestimonials",
  "facebookId": "100064851213767",
  "viewsCount": 7,
  "shares": 0,
  "likes": 0
},
{
  "text": "Our Queens are free to roam, peck, and explore the great outdoors! Their stress-free life means high-quality, tastier eggs for your table - naturally better in every way. Make the right choice for both the planet and your family with eggs that come from care and freedom. \n\n[Farm Made Foods, Your Right Choice, Free-range Eggs, Healthy Hens, Life on our Farms, Living the Best Life, Ethical Farming Practices, Life of our Hens, Freedom, Care]\n\n#farmmadefoods #yourrightchoice #freerangeeggs #healthyhens",
  "facebookId": "100064851213767",
  "shares": 0,
  "likes": 1
},
{
  "text": "Cheers to a New Year filled with sunny days and happy moments! ☀\n\nOur Queens are all set to strut into 2025, living their best lives - roaming freely, foraging naturally, and thriving in the open air. No compromises, just healthier eggs from hens who know freedom like no other!\n\nHead to the link in our bio to order your box of free-range eggs!\n\n[Farm Made Foods, Your Right Choice, Free-range Eggs, Healthy Hens, Farm Life, Life full of Freedom, Sunshine, Certified Humane, Happy New Year, New Year 2025, Resolutions, Living The Best Life]\n\n#farmmadefoods #yourrightchoice #freerangeeggs #happynewyear",
  "facebookId": "100064851213767",
  "viewsCount": 11,
  "shares": 0,
  "likes": 0
},
{
  "text": "Ever wondered what makes brown eggs, well… brown? \n\nThe eggshell is made of calcium carbonate, which is naturally white. Brown eggs get their unique colour from a pigment called protoporphyrin IX, a by-product of hemoglobin. This pigment is added only to the outermost layer naturally during the final stage of egg formation.\n\nThat’s why the brown colour is just on the surface! Sometimes, it can rub off or even fade slightly during boiling, but don’t worry, that’s completely normal! Brown eggs that lose their colour are still fresh, safe, and just as nutritious as ever!\n\n[Farm Made Foods, Your Right Choice, Free-range Eggs, Questions Related to Eggs, FAQs, Free-range Farming, Eggs and Nutrition, Know Your Eggs, Egg Lovers, Brown Eggs, Frequently Asked Questions about Eggs]\n\n#farmmadefoods #yourrightchoice #freerangeeggs #faq #browneggs",
  "facebookId": "100064851213767",
  "shares": 0,
  "likes": 4
},
{
  "text": "Snow or no snow, you can still make a snowman this Christmas! Try our delicious Snowman Toast recipe and drop a heart in the comments if you're going for it. Click the link in our bio to get our free-range eggs.\n\nIngredients:\n-2 free-range eggs (separated)\n-2 slices of bread\n-1 tbsp butter\n-½ pc capsicum (for buttons)\n-1 pc carrot (for the nose)\n-1 pc black olive (cut into tiny squares, for eyes)\n\nMethod:\n-In a medium sized bowl, crack and separate the free-range egg yolks from the whites and place the yolks into a small bowl, and keep aside. \n-Using a 2 inch, and a 1.5 inch cookie cutter, cut the bread slices into the shape of a snowman.\n-Heat some butter in a pan on low heat, place the cut bread in the pan. \n-Pour the egg white into the cut holes of the bread, and cook on a low heat. \n-Once the egg white is semi-cooked, place the buttons, eyes and nose, and allow the egg to cook fully. \n-Once fully cooked, serve warm.\n\n[Farm Made Foods, Your Right Choice, Snowman Toast, Christmas Treats, Holiday Season, Christmas Recipes, Merry Munchies,  Holiday Cooking, Christmas Cheer, Holiday Meals, Egg Recipes, Easy to Make, Recipes for Kids, Breakfast Ideas, 'Tis the Season, Toast in Different Ways, Christmas Breakfast]\n\n#farmmadefoods #yourrightchoice #freerangeeggs #snowmantoast #christmastoast #holidaytoast #festivetoast #christmasbreakfast #holidayrecipes #christmascooking",
  "facebookId": "100064851213767",
  "viewsCount": 34,
  "shares": 0,
  "likes": 4
},
{
  "text": "Our holiday postcards are here! 🎄\nCollect them all, tag us, and you could win a festive hamper!\n\n[Farm Made Foods, Your Right Choice, Free-range Eggs, Holiday Postcards, Festive Season, Merry Christmas, Happy New Year, Postcards, Life on our Farms, Holiday Season, Holiday Cheer]\n\n#farmmadefoods #yourrightchoice #freerangeeggs #merrychristmas #happynewyear #postcards #festiveseason",
  "facebookId": "100064851213767",
  "viewsCount": 17,
  "shares": 0,
  "likes": 4
},
{
  "comments": 9,
  "text": "Spot all the hidden egg dishes in this grid! \nList as many as you can in the comments below, and you could be one of 5 lucky winners to receive our festive hamper this holiday season.\n\n[Farm Made Foods, Your Right Choice, Free-range eggs, Egg Lovers, Egg Recipes, Egg Dishes, Eggs, Word Search, Words related to Eggs, Dishes made out of Eggs, Easy to make]\n\n#farmmadefoods #yourrightchoice #freerangeeggs #eggs #egglovers #wordsearch",
  "facebookId": "100064851213767",
  "shares": 4,
  "likes": 10
},
{
  "text": "Freedom to forage, space to roam, and nature to thrive - just another day at our farm!\n\n[Farm Made Foods, Your Right Choice, Free-range Eggs, Healthy Hens, Life on our Farms, Living the Best Life, Ethical Farming Practices, Life of our Hens, Life Outdoors, Freedom, Good for the Planet]\n\n#farmmadefoods #yourrightchoice #freerangeeggs #healthyhens",
  "facebookId": "100064851213767",
  "shares": 0,
  "likes": 2
},
{
  "text": "Explore Farm Made Foods’ range of products to help you make the right choice. \n\nOur free-range eggs are laid by hens who live a life full of freedom in stress-free environments. Their active lifestyle helps them lay healthier eggs - which is not just good for them and you, but the planet too! \n\nOur Coconut Sugar and Coconut Sugar Delights (Coconut Candy, Coconut Laddu, Sesame Laddu) \nare 100% natural with no added chemicals or preservatives. Try these for yourself to taste the goodness.\n\n#farmmadefoods #yourrightchoice #freerangeeggs #coconutsugar",
  "facebookId": "100064851213767",
  "shares": 0,
  "likes": 2
},
{
  "text": "A delighted consumer knows best. Here’s one of our happy customers sharing her take on our Sesame Laddus - straight from the heart!\n\n[Farm Made Foods, Your Right Choice, Coconut Sugar, Sesame Laddu, Sweets Made out of Coconut Sugar, Guilt-Free Delight, Handmade Sweets, Customer Testimonials, Health-Conscious Picks, Sustainable Choices, Chosen by Moms, Loved by Kids]\n\n#farmmadefoods #yourrightchoice #coconutsugar #customertestimonials #customerreviews\n#customerapproved",
  "facebookId": "100064851213767",
  "viewsCount": 12,
  "shares": 0,
  "likes": 1
},
{
  "text": "Rich, creamy, and dairy-free! Whip up this Coconut Sugar Chocolate Mousse using simple ingredients for the perfect indulgence. Try it with Farm Made Foods' Coconut Sugar for the ultimate experience!\n\nIngredients:\n-3 free-range eggs (separated into yolks and whites)\n-⅓ cup coconut sugar\n-2 ¼ cups heavy cream\n-200gm semi-sweet chocolate (finely chopped)\n\nMethod:\n-In a large bowl, whisk together the free-range egg yolks and Farm Made Foods’ Coconut Sugar for about 1 minute, just until lightened in color and velvety.\n-In a small saucepan, heat 1¼ cups of cream over medium heat for, about 4 minutes. \n-Remove from the heat.\n-Add the chocolate and stir constantly until fully melted. \n-Slowly whisk chocolate into the egg yolks until fully combined. Set aside to cool, stirring occasionally, until barely warm to the touch, for about 30 minutes.\n-In another large bowl, beat the egg whites until stiff peaks form. \nFold a third of the egg white mixture into the chocolate mixture to loosen it.\n-Fold the remaining egg white mixture in just until a few streaks remain.\n-In a large bowl, beat the remaining 1 cup of cream until stiff peaks form. --Fold whipped cream into the chocolate mixture. \n-Fill 6 to 8 small serving glasses with the mousse.\n-Chill until set, for about 4 hours. \n-Serve topped with whipped cream and chocolate shavings, if desired.\n\nMusic Credits: Run Rudolph Run - Chuck Berry\n\n[Farm Made Foods, Your Right Choice, Coconut Sugar, Coconut Delights, Handmade Sweets, No Chemicals, No Added Preservatives, Guilt-free Delights, Healthy Snacking]\n\n#FarmMadeFoods #YourRightChoice #CoconutSugar #NaturalSweetener #HealthyLiving #CoconutSugarDelights",
  "facebookId": "100064851213767",
  "viewsCount": 19,
  "shares": 0,
  "likes": 1
},
{
  "text": "Coconut Sugar, a natural and unrefined alternative to regular sugar, is made from the sap of coconut tree flowers. It’s low on the glycemic index and rich in nutrients like potassium, iron, zinc, and calcium. Farm Made Foods Coconut Sugar is free of preservatives or chemicals, and is a perfect 1:1 substitute for white sugar - ideal for your morning coffee, tea, baking, and cooking. By choosing our sustainably harvested coconut sugar, you’re making the right choice not just for yourself but for the planet too. \n\n[Farm Made Foods, Your Right Choice, Free-range Eggs Coconut Sugar, Coconut Delights, Handmade Sweets, Chemical-free, Guilt-free]\n\n#FarmMadeFoods #YourRightChoice #CoconutSugar #NaturalSweetener #HealthyLiving #CoconutSugarDelights",
  "facebookId": "100064851213767",
  "shares": 0,
  "likes": 0
},
{
  "text": "Simple, natural, and delightful -that’s what Farm Made Foods’ Coconut Sugar is all about! Our Coconut Sugar is pure, unrefined, and free from any chemicals. Using this natural sweetener we make Coconut Candy, Coconut Laddu, and Sesame Laddu - all of these are recipes passed down through generations. Trust us, these delights will bring back the sweetest memories!\n\n[Farm Made Foods, Your Right Choice, Coconut Sugar, Coconut Delights, Chemical-Free, Sweets made out of Coconut Sugar, Guilt-free, Handmade Sweets, No Chemicals, No Added Preservatives, Coconut Laddu, Coconut Candy, Sesame Laddu, Healthy Treats]\n\n#FarmMadeFoods #YourRightChoice #CoconutSugar #NaturalSweetener #CoconutDelights #HealthyTreats #TraditionalSweets",
  "facebookId": "100064851213767",
  "shares": 0,
  "likes": 0
}]